package com.company.lesson002.homework;

// Вывод информации, потренироваться в создание текстового интерфейса
// При подключение к серверу, часто печатается полезная информация, придумать интерфейс для нее
// 1) Загруженность ядер CPU, %
// 2) Количество используемой памяти, %
// 3) Ip: сервера
// 4) Пользователей онлайн
// 5) Время дата сервера
public class HW1 {

    public static void main(String[] args) {
        System.out.println("Загруженность ядер CPU: " + 38 +"%");
        System.out.println("Количество используемой памяти: " + 75+ "%");
        System.out.println("Ip-сервера: " + 5+"."+255+"."+95+"."+40 );
        System.out.println("Время : " + 16+":"+'0'+ 5 +"  " +"дата сервера: "+ 24+"."+'0'+4+"."+2017);

    }
}