package com.company.lesson002.homework;


// Текстовая-игра
// Есть жизни героя и жизни пративника
// пользователю предлагается действия
// 1) Показать информацию о герое
// 2) Показать информацию о пративнике
// 3) Ударить противника, урон (10-20), но тогда и противник ударит тебя(20-30)
// 4) Выпить зелье, восстанавливает здоровье до 100
// 5) ударить, но укланиться за щитом, герой наносит (10-20), есть вероятность 70% укланиться от удара,
// но если герой не уклонился он получает увеличенный урон 2

// Если убили героя, написать вы проиграли, если убили противника, написать пративник мертв
public class HW6 {
}
